app/Soap/Fedex/OpenShipService/OpenShip_v13/CreateConsolidationRequest_Reply.txt

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:v13="http://fedex.com/ws/openship/v13">
   <soapenv:Header>
   </soapenv:Header>
   <soapenv:Body>
     <v13:CreateConsolidationRequest>
           <v13:WebAuthenticationDetail>
            <v13:UserCredential>
               <v13:Key>Input Your Information</v13:Key>
               <v13:Password>Input Your Information</v13:Password>
            </v13:UserCredential>
         </v13:WebAuthenticationDetail>
         <v13:ClientDetail>
            <v13:AccountNumber>Input Your Information</v13:AccountNumber>
            <v13:MeterNumber>Input Your Information</v13:MeterNumber>
         </v13:ClientDetail>
         <v13:TransactionDetail>
            <v13:CustomerTransactionId>CreateConsolidationRequest_v13</v13:CustomerTransactionId>
         </v13:TransactionDetail>
         <v13:Version>
            <v13:ServiceId>ship</v13:ServiceId>
            <v13:Major>13</v13:Major>
            <v13:Intermediate>0</v13:Intermediate>
            <v13:Minor>0</v13:Minor>
         </v13:Version>
         <v13:ConsolidationIndex>Input Your Information</v13:ConsolidationIndex>
         <v13:RequestedConsolidation>
            <v13:ConsolidationType>INTERNATIONAL_PRIORITY_DISTRIBUTION</v13:ConsolidationType>
            <v13:ShipDate>2014-05-26</v13:ShipDate>
            <v13:Shipper>
               <v13:AccountNumber>Input Your Information</v13:AccountNumber>
               <v13:Tins>
                  <v13:TinType>BUSINESS_NATIONAL</v13:TinType>
                  <v13:Number>INDIVIDUAL</v13:Number>
                  <v13:Usage></v13:Usage>
               </v13:Tins>
               <v13:Contact>
                  <v13:PersonName>Input Your Information</v13:PersonName>
                  <v13:CompanyName>Input Your Information</v13:CompanyName>
                  <v13:PhoneNumber>Input Your Information</v13:PhoneNumber>
                  <v13:EMailAddress>Input Your Information</v13:EMailAddress>
               </v13:Contact>
               <v13:Address>
                  <v13:StreetLines>Input Your Information</v13:StreetLines>
                  <v13:StreetLines>Input Your Information</v13:StreetLines>
                  <v13:City>BOSTON</v13:City>
                  <v13:StateOrProvinceCode>MA</v13:StateOrProvinceCode>
                  <v13:PostalCode>021104101</v13:PostalCode>
                  <v13:CountryCode>US</v13:CountryCode>
                  <v13:Residential>0</v13:Residential>
               </v13:Address>
            </v13:Shipper>
            <v13:Origin>
               <v13:Contact>
                  <v13:PersonName>Input Your Information</v13:PersonName>
                  <v13:CompanyName>Input Your Information</v13:CompanyName>
                  <v13:PhoneNumber>Input Your Information</v13:PhoneNumber>
                  <v13:EMailAddress>Input Your Information</v13:EMailAddress>
               </v13:Contact>
               <v13:Address>
                  <v13:StreetLines>Input Your Information</v13:StreetLines>
                  <v13:StreetLines>Input Your Information</v13:StreetLines>
                  <v13:City>BOSTON</v13:City>
                  <v13:StateOrProvinceCode>MA</v13:StateOrProvinceCode>
                  <v13:PostalCode>021104101</v13:PostalCode>
                  <v13:CountryCode>US</v13:CountryCode>
                  <v13:Residential>0</v13:Residential>
               </v13:Address>
            </v13:Origin>
            <v13:SoldTo>
               <v13:AccountNumber>Input Your Information</v13:AccountNumber>
               <v13:Contact>
                  <v13:PersonName>Input Your Information</v13:PersonName>
                  <v13:CompanyName>Input Your Information</v13:CompanyName>
                  <v13:PhoneNumber>Input Your Information</v13:PhoneNumber>
                  <v13:EMailAddress>Input Your Information</v13:EMailAddress>
               </v13:Contact>
               <v13:Address>
                  <v13:StreetLines>Input Your Information</v13:StreetLines>
                  <v13:City>RICHMOND</v13:City>
                  <v13:StateOrProvinceCode>BC</v13:StateOrProvinceCode>
                  <v13:PostalCode>v13C4v5</v13:PostalCode>
                  <v13:CountryCode>CA</v13:CountryCode>
                  <v13:CountryName>CANADA</v13:CountryName>
                  <v13:Residential>0</v13:Residential>
               </v13:Address>
            </v13:SoldTo>
            <v13:BookingNumber>Input Your Information</v13:BookingNumber>
            <v13:ConsolidationDataSources>
               <v13:Field>TOTAL_INSURANCE_CHARGES</v13:Field>
               <v13:Source>CLIENT</v13:Source>
            </v13:ConsolidationDataSources>
            <v13:CustomerReferences>
               <v13:CustomerReferenceType>CUSTOMER_REFERENCE</v13:CustomerReferenceType>
               <v13:Value>USD</v13:Value>
            </v13:CustomerReferences>
            <v13:LabelSpecification>
               <v13:LabelFormatType>COMMON2D</v13:LabelFormatType>
               <v13:ImageType>PNG</v13:ImageType>
               <v13:LabelStockType>PAPER_7X4.75</v13:LabelStockType>
            </v13:LabelSpecification>
            <v13:InternationalDistributionDetail>
               <v13:DropoffType>REGULAR_PICKUP</v13:DropoffType>
               <v13:TotalDimensions>
                  <v13:Length>12</v13:Length>
                  <v13:Width>12</v13:Width>
                  <v13:Height>12</v13:Height>
                  <v13:Units>IN</v13:Units>
               </v13:TotalDimensions>
               <v13:TotalInsuredValue>
                  <v13:Currency>USD</v13:Currency>
                  <v13:Amount>100.0</v13:Amount>
               </v13:TotalInsuredValue>
               <v13:UnitSystem>ENGLISH</v13:UnitSystem>
               <v13:DeclarationCurrencies>
                  <v13:Value>CUSTOMS_VALUE</v13:Value>
                  <v13:Currency>USD</v13:Currency>
               </v13:DeclarationCurrencies>
               <v13:ClearanceFacilityLocationId>YMXI</v13:ClearanceFacilityLocationId>
            </v13:InternationalDistributionDetail>
            <v13:CustomsClearanceDetail>
               <v13:CustomsOptions>
                  <v13:Type>OTHER</v13:Type>
                  <v13:Description>Consolidatedproduct</v13:Description>
               </v13:CustomsOptions>
               <v13:ImporterOfRecord>
                  <v13:AccountNumber>Input Your Information</v13:AccountNumber>
                  <v13:Contact>
                     <v13:PersonName>Input Your Information</v13:PersonName>
                     <v13:CompanyName>Input Your Information</v13:CompanyName>
                     <v13:PhoneNumber>Input Your Information</v13:PhoneNumber>
                     <v13:EMailAddress>Input Your Information</v13:EMailAddress>
                  </v13:Contact>
                  <v13:Address>
                     <v13:StreetLines>Input Your Information</v13:StreetLines>
                     <v13:City>RICHMOND</v13:City>
                     <v13:StateOrProvinceCode>BC</v13:StateOrProvinceCode>
                     <v13:PostalCode>v13C4v5</v13:PostalCode>
                     <v13:CountryCode>CA</v13:CountryCode>
                     <v13:CountryName>CANADA</v13:CountryName>
                     <v13:Residential>0</v13:Residential>
                  </v13:Address>
               </v13:ImporterOfRecord>
               <v13:RecipientCustomsId>
                  <v13:Type>COMPANY</v13:Type>
                  <v13:Value>125</v13:Value>
               </v13:RecipientCustomsId>
               <v13:DutiesPayment>
                  <v13:PaymentType>Input Your Information</v13:PaymentType>
                  <v13:Payor>
                     <v13:ResponsibleParty>
                        <v13:AccountNumber>Input Your Information</v13:AccountNumber>
                        <v13:Contact>
                           <v13:PersonName>Input Your Informationnadh</v13:PersonName>
                           <v13:CompanyName>Input Your Information</v13:CompanyName>
                           <v13:PhoneNumber>Input Your Information</v13:PhoneNumber>
                           <v13:EMailAddress>Input Your Information</v13:EMailAddress>
                        </v13:Contact>
                        <v13:Address>
                           <v13:StreetLines>Input Your Information</v13:StreetLines>
                           <v13:StreetLines>Input Your Information</v13:StreetLines>
                           <v13:City>BOSTON</v13:City>
                           <v13:StateOrProvinceCode>MA</v13:StateOrProvinceCode>
                           <v13:PostalCode>021104101</v13:PostalCode>
                           <v13:CountryCode>US</v13:CountryCode>
                           <v13:Residential>0</v13:Residential>
                        </v13:Address>
                     </v13:ResponsibleParty>
                  </v13:Payor>
               </v13:DutiesPayment>
               <v13:DocumentContent>DERIVED</v13:DocumentContent>
               <v13:CustomsValue>
                  <v13:Currency>USD</v13:Currency>
                  <v13:Amount>1000.0</v13:Amount>
               </v13:CustomsValue>
               <v13:InsuranceCharges>
                  <v13:Currency>USD</v13:Currency>
                  <v13:Amount>1000.0</v13:Amount>
               </v13:InsuranceCharges>
               <v13:CommercialInvoice>
                  <v13:TermsOfSale>DDP</v13:TermsOfSale>
               </v13:CommercialInvoice>
               <v13:Commodities>
                  <v13:Name>product</v13:Name>
                  <v13:NumberOfPieces>1</v13:NumberOfPieces>
                  <v13:Description>product</v13:Description>
                  <v13:CountryOfManufacture>US</v13:CountryOfManufacture>
                  <v13:Weight>
                     <v13:Units>LB</v13:Units>
                     <v13:Value>10</v13:Value>
                  </v13:Weight>
                  <v13:Quantity>1</v13:Quantity>
                  <v13:QuantityUnits>X</v13:QuantityUnits>
                  <v13:UnitPrice>
                     <v13:Currency>USD</v13:Currency>
                     <v13:Amount>1000.00</v13:Amount>
                  </v13:UnitPrice>
                  <v13:CustomsValue>
                     <v13:Currency>USD</v13:Currency>
                     <v13:Amount>1000.0</v13:Amount>
                  </v13:CustomsValue>
               </v13:Commodities>
               <v13:ExportDetail>
                  <v13:ExportComplianceStatement>30.37(f)</v13:ExportComplianceStatement>
               </v13:ExportDetail>
            </v13:CustomsClearanceDetail>
            <v13:ShippingChargesPayment>
               <v13:PaymentType>Input Your Information</v13:PaymentType>
               <v13:Payor>
                  <v13:ResponsibleParty>
                     <v13:AccountNumber>Input Your Information</v13:AccountNumber>
                     <v13:Contact>
                        <v13:PersonName>Input Your Information</v13:PersonName>
                        <v13:CompanyName>Fedex</v13:CompanyName>
                        <v13:PhoneNumber>Input Your Information</v13:PhoneNumber>
                        <v13:EMailAddress>Input Your Information.ch@gmail.com</v13:EMailAddress>
                     </v13:Contact>
                     <v13:Address>
                        <v13:StreetLines>Input Your Information</v13:StreetLines>
                        <v13:StreetLines>Input Your Information</v13:StreetLines>
                        <v13:City>BOSTON</v13:City>
                        <v13:StateOrProvinceCode>MA</v13:StateOrProvinceCode>
                        <v13:PostalCode>021104101</v13:PostalCode>
                        <v13:CountryCode>US</v13:CountryCode>
                        <v13:Residential>0</v13:Residential>
                     </v13:Address>
                  </v13:ResponsibleParty>
               </v13:Payor>
            </v13:ShippingChargesPayment>
         </v13:RequestedConsolidation>
      </v13:CreateConsolidationRequest>
   </soapenv:Body>
</soapenv:Envelope>


Out:

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/">
   <env:Header xmlns:env="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"/>
   <soapenv:Body>
      <v13:CreateConsolidationReply xmlns:env="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:v13="http://fedex.com/ws/openship/v13">
         <v13:HighestSeverity>WARNING</v13:HighestSeverity>
         <v13:Notifications>
            <v13:Severity>WARNING</v13:Severity>
            <v13:Source>ship</v13:Source>
            <v13:Code>6711</v13:Code>
            <v13:Message>Sold To postal city mis-match.</v13:Message>
            <v13:LocalizedMessage>Sold To postal city mis-match.</v13:LocalizedMessage>
         </v13:Notifications>
         <v13:Notifications>
            <v13:Severity>WARNING</v13:Severity>
            <v13:Source>ship</v13:Source>
            <v13:Code>3426</v13:Code>
            <v13:Message>International Importer of Record - Postal-City Mismatch</v13:Message>
            <v13:LocalizedMessage>International Importer of Record - Postal-City Mismatch</v13:LocalizedMessage>
         </v13:Notifications>
         <v13:TransactionDetail>
            <v13:CustomerTransactionId>CreateConsolidationRequest_v13</v13:CustomerTransactionId>
         </v13:TransactionDetail>
         <v13:Version>
            <v13:ServiceId>ship</v13:ServiceId>
            <v13:Major>13</v13:Major>
            <v13:Intermediate>0</v13:Intermediate>
            <v13:Minor>0</v13:Minor>
         </v13:Version>
         <v13:ConsolidationKey>
            <v13:Type>INTERNATIONAL_PRIORITY_DISTRIBUTION</v13:Type>
            <v13:Index>Input Your Information</v13:Index>
            <v13:Date>2016-12-04</v13:Date>
         </v13:ConsolidationKey>
         <v13:TrackingIds>
            <v13:TrackingIdType>EXPRESS</v13:TrackingIdType>
            <v13:FormId>0431</v13:FormId>
            <v13:TrackingNumber>Input Your Information</v13:TrackingNumber>
         </v13:TrackingIds>
      </v13:CreateConsolidationReply>
   </soapenv:Body>
</soapenv:Envelope>
